src/DataProcessors/KFK_Консьюмер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>KFK_Консьюмер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Консьюмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KFK_Консьюмеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KFK_Брокеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Топик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочитанныеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партиция</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВременнаяМетка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смещение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/KFK_Консьюмер/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем КомпонентаСлушателя; 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийРежим = "Остановлено";  
	
	Если Параметры.Свойство("Консьюмер") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры, "Консьюмер, Брокер");
		КонсьюмерПриИзмененииНаСервере();
  		Элементы.Топик.СписокВыбора.ЗагрузитьЗначения(
			KFK_ИнтеграцияВызовСервера.ЗаполнитьСписокВыбораТопиков(Объект.Брокер).ВыгрузитьЗначения());  
		
		БрокерПриИзмененииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)    
	
	ИдентификаторВК = KFK_ИнтеграцияВызовСервера.ИдентификаторВнешнейКомпоненты();
	Подключено = Ждать KFK_ИнтеграцияКлиент.ПодключитьКомпонентуКафка(ИдентификаторВК); 
	
	Отказ = (НЕ Подключено);
	
	Если НЕ Отказ Тогда
		Попытка
			КомпонентаСлушателя = Новый(СтрШаблон("AddIn.%1.simpleKafka1C", ИдентификаторВК));
		Исключение
			ВызватьИсключение "Компонента <Simple Kafka 1C> не подключена!";
		КонецПопытки; 		
	КонецЕсли;      
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ТекущийРежим = "Прослушивание" Тогда  		
		Ждать КомпонентаСлушателя.ОстановитьКонсьюмераАсинх();    
	КонецЕсли;
	
	КомпонентаСлушателя = Неопределено;  
	
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытийФормы

&НаКлиенте
Процедура БрокерПриИзменении(Элемент) 
	
	Элементы.Топик.СписокВыбора.ЗагрузитьЗначения(
		KFK_ИнтеграцияВызовСервера.ЗаполнитьСписокВыбораТопиков(Объект.Брокер).ВыгрузитьЗначения());  
		
	БрокерПриИзмененииНаСервере();	

КонецПроцедуры  

Процедура БрокерПриИзмененииНаСервере()
	
	АдресБрокера = Объект.Брокер.АдресБрокера;
	ЗаполнитьПараметрыПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура КонсьюмерПриИзменении(Элемент)
	
	КонсьюмерПриИзмененииНаСервере();
	
КонецПроцедуры   

Процедура КонсьюмерПриИзмененииНаСервере()
	
	Объект.Брокер = Объект.Консьюмер.Брокер;     
	ПолучатьРезультатДвоичнымиДанными = Объект.Консьюмер.ПолучатьСообщенияДвоичнымиДанными;
	
	АдресБрокера = Объект.Брокер.АдресБрокера;
	ТаймаутОжиданияСообщений = Объект.Консьюмер.ТаймаутОжиданияСообщений; 
	ИдентификаторГруппы = Объект.Консьюмер.Идентификатор;  
	КаталогЛогов = Объект.Консьюмер.КаталогЛогов;
	
	Элементы.Топик.СписокВыбора.ЗагрузитьЗначения(
		KFK_ИнтеграцияВызовСервера.ЗаполнитьСписокВыбораТопиков(Объект.Брокер).ВыгрузитьЗначения());   
		
	ЗаполнитьПараметрыПодключения();	
	
КонецПроцедуры     

Процедура ЗаполнитьПараметрыПодключения()
	
	ПараметрыПодключения.Очистить();
	
	Для каждого Параметр Из Объект.Брокер.ПараметрыПодключения Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения.Добавить(), Параметр);	
	КонецЦикла;    
	
	Для каждого Параметр Из Объект.Консьюмер.ПараметрыКонсьюмера Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения.Добавить(), Параметр);	
	КонецЦикла;            
	
	Параметр = ПараметрыПодключения.Добавить();     
	Параметр.Ключ = "group.id";
	Параметр.Значение = ИдентификаторГруппы;
			
КонецПроцедуры

&НаКлиенте
Асинх Процедура СлушатьСообщения(Команда)      
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;     
	
	Если КомпонентаСлушателя = Неопределено Тогда
		ИдентификаторВК = KFK_ИнтеграцияВызовСервера.ИдентификаторВнешнейКомпоненты();
		Подключено = Ждать KFK_ИнтеграцияКлиент.ПодключитьКомпонентуКафка(ИдентификаторВК); 
		
		Отказ = (НЕ Подключено);
		
		Если НЕ Отказ Тогда
			Попытка
				КомпонентаСлушателя = Новый(СтрШаблон("AddIn.%1.simpleKafka1C", ИдентификаторВК));
			Исключение
				ВызватьИсключение "Компонента <Simple Kafka 1C> не подключена!";
			КонецПопытки; 		
		КонецЕсли;      
	КонецЕсли;
	
	ТекстВопроса = ?(ТекущийРежим = "Прослушивание", "Остановить прослушивание?", "Начать прослушивание?");
	
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх(ТекстВопроса, Режим, 0);
	
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;	
	
	Если ТекущийРежим = "Остановлено" Тогда
		ЗапуститьПрослушиваниеТопикаНаКлиенте();    
		
		ТекущийРежим = "Прослушивание";	 
		Элементы.ФормаСлушатьСообщения.Заголовок = "Остановить";  
	Иначе
		ОстановитьПрослушиваниеТопикаНаКлиенте();        
		
		ТекущийРежим = "Остановлено";
		Элементы.ФормаСлушатьСообщения.Заголовок = "Слушать сообщения"; 
	КонецЕсли;             	
	
КонецПроцедуры    

&НаКлиенте
Асинх Процедура ОбработчикПрослушиванияТопика()    
	
	Попытка       
		СообщениеПрочитано = Ждать КомпонентаСлушателя.ПрочитатьСообщениеАсинх();
	Исключение   
		ОписаниеОшибки = Ждать КомпонентаСлушателя.ПолучитьСообщениеОбОшибкеАсинх();
		КомпонентаСлушателя = Неопределено;                                                         
		ВызватьИсключение ОписаниеОшибки() + " " + ОписаниеОшибки;
	КонецПопытки;		   
	
	Если НЕ СообщениеПрочитано.Значение Тогда
		Возврат;
	КонецЕсли; 
	
	Сообщение 	= Ждать КомпонентаСлушателя.ПолучитьДанныеСообщенияАсинх(ПолучатьРезультатДвоичнымиДанными); // сообщение как оно есть (если передать Истина), если не указывать параметр - возвращается строка UTF-8
	Ключ 		= Ждать КомпонентаСлушателя.ПолучитьКлючСообщенияАсинх();
	Заголовки 	= Ждать КомпонентаСлушателя.ПолучитьЗаголовкиСообщенияАсинх();
	БрокерИд 	= Ждать КомпонентаСлушателя.ПолучитьИдентификаторБрокераСообщенияАсинх();
	ВременнаяМетка 	= Ждать КомпонентаСлушателя.ПолучитьВременнуюМеткуСообщенияАсинх();
	Партиция 	= Ждать КомпонентаСлушателя.ПолучитьРазделСообщенияАсинх();
	Смещение 	= Ждать КомпонентаСлушателя.ПолучитьСмещениеСообщенияАсинх();   
	
	СтрокаДанных = Объект.ПрочитанныеСообщения.Добавить();
	СтрокаДанных.Сообщение = Сообщение.Значение;
	СтрокаДанных.Ключ = Ключ.Значение;
	СтрокаДанных.Заголовки = Заголовки.Значение;
	СтрокаДанных.ВременнаяМетка = ВременнаяМетка.Значение;
	СтрокаДанных.Смещение = Смещение.Значение;
	СтрокаДанных.Партиция = Партиция.Значение;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции  

&НаКлиенте
Асинх Процедура ЗапуститьПрослушиваниеТопикаНаКлиенте()
	
	Ждать КомпонентаСлушателя.УстановитьКаталогЛоговАсинх(КаталогЛогов); 
	// Устанавливаем таймаут остановки 30 секунд (по умолчанию 10 сек)
	Ждать КомпонентаСлушателя.УстановитьТаймаутОчисткиКонсьюмера(30000);
	
	Для Каждого Параметр Из ПараметрыПодключения Цикл
		Ждать КомпонентаСлушателя.УстановитьПараметрАсинх(СокрЛП(Параметр.Ключ), СокрЛП(Параметр.Значение));	
	КонецЦикла;	
	
	Результат = Ждать КомпонентаСлушателя.ИнициализироватьКонсьюмераАсинх(АдресБрокера);                       
	Результат = Ждать КомпонентаСлушателя.ПодписатьсяАсинх(Объект.Топик);
	
	Если Результат.Значение Тогда                                
		Ждать КомпонентаСлушателя.УстановитьТаймаутОжиданияАсинх(ТаймаутОжиданияСообщений);	
		ПодключитьОбработчикОжидания("ОбработчикПрослушиванияТопика", 1);   
	Иначе                 
		СообщениеОбОшибке = Ждать КомпонентаСлушателя.ПолучитьСообщениеОбОшибкеАсинх();
		ВызватьИсключение СообщениеОбОшибке.Значение;	
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Асинх Процедура ОстановитьПрослушиваниеТопикаНаКлиенте()   
	
	ОтключитьОбработчикОжидания("ОбработчикПрослушиванияТопика");  
	
	РезультатОстановки = Ждать КомпонентаСлушателя.ОстановитьКонсьюмераАсинх();   
	Если НЕ РезультатОстановки.Значение Тогда  
		СообщениеОбОшибке = КомпонентаСлушателя.ПолучитьСообщениеОбОшибке();
		КомпонентаСлушателя = Неопределено;
		ВызватьИсключение СообщениеОбОшибке;		
	КонецЕсли;
	
	КомпонентаСлушателя = Неопределено;
	
КонецПроцедуры     

#КонецОбласти
